import './PageStyles.css';

const About = () => {
  return (
    <section className="page about">
      <div className="container">
        <h2>Обо мне</h2>
        <p>
          Привет! Меня зовут Катя, и я frontend разработчик. С 2021 года я
          превращаю макеты в удобные и быстрые сайты.
        </p>
        <p>
          Мне нравится моя работа, потому что это идеальное сочетание логики и
          творчества. Люблю видеть, как код превращается в понятный и живой
          интерфейс.
        </p>
        <p>
          Легко вливаюсь в команду, ценю честный фидбек и открытость. При этом я
          могу быть автономна. Если нужно сесть и разобраться в сложной задаче в
          одиночку, то погружаюсь в процесс с головой и вниманием к деталям.
        </p>
        <p>
          В свободное время люблю экспериментировать с новыми технологиями и
          иногда нахожу нестандартные решения именно там, где меньше всего
          ожидаешь.
        </p>
      </div>
    </section>
  );
};

export default About;
