import './PageStyles.css';

const About = () => {
  return (
    <section className="page about">
      <div className="container">
        <h2>Обо мне</h2>
        <p>
          Привет! Я Екатерина, и я — начинающая фронтенд-разработчица, которая с
          увлечением погружается в мир веб-разработки. За это время я успела
          освоить HTML, CSS, JavaScript и React, чтобы создавать интерфейсы,
          которые не только выглядят привлекательно, но и удобны для
          пользователей.
        </p>
        <p>
          Фронтенд для меня — это не просто код, а способ сделать интернет
          чуточку лучше и красивее. Каждый новый проект — это возможность
          улучшить свои навыки и подойти к задаче с вниманием к деталям.
        </p>
        <p>
          Вдохновение для работы я черпаю в путешествиях и маленьких моментах
          повседневной жизни — будь то цвет неба на закате или уютное кафе за
          углом. Я верю, что даже простые вещи могут подарить идеи для дизайна и
          анимаций, которые привлекают пользователей.
        </p>
        <p>
          Готова работать над новыми проектами и постоянно учиться! Если у вас
          есть интересная задумка, буду рада обсудить её и сделать первый шаг к
          чему-то особенному.
        </p>
      </div>
    </section>
  );
};

export default About;
