import './PageStyles.css';

const About = () => {
  return (
    <section className="page about">
      <div className="container">
        <h2>Обо мне</h2>
        <p>
          Привет! Я Екатерина, и я frontend разработчица. С 2021 года создаю
          интерфейсы, которые помогают людям комфортно и легко взаимодействовать
          с сайтами и приложениями.
        </p>
        <p>
          Мне нравится моя работа, потому что это идеальное сочетание логики и
          творчества. Люблю видеть, как код превращается в понятный и живой
          интерфейс.
        </p>
        <p>
          Комфортно работаю как в команде, так и самостоятельно. В коллективе
          ценю открытость и ясную коммуникацию — когда все на одной волне,
          получается создавать по-настоящему крутые вещи. А когда работаю одна,
          полностью погружаюсь в задачу и внимательно слежу за деталями.
        </p>
        <p>
          В свободное время люблю экспериментировать с новыми технологиями и
          иногда нахожу нестандартные решения именно там, где меньше всего
          ожидаешь.
        </p>
      </div>
    </section>
  );
};

export default About;
