import './PageStyles.css';

const About = () => {
  return (
    <section className="page about">
      <div className="container">
        <h2>Обо мне</h2>
        <p>
          Привет! Меня зовут Екатерина и я — фронтенд-разработчица с 2021 года.
          Я верю, что каждый сайт — это не просто код, а маленькая история,
          которую мы рассказываем пользователям. Моя цель — создавать интуитивно
          понятные и функциональные интерфейсы, которые улучшают
          пользовательский опыт
        </p>
        <p>
          Я начала свой путь в веб-разработке с увлечения программированием, и с
          тех пор моя страсть только растет. Я осваивала технологии, такие как
          HTML, CSS, JavaScript и React, чтобы делать проекты, которые
          вдохновляют и удовлетворяют потребности пользователей.
        </p>
        <p>
          Помимо работы, я люблю путешествовать и фотографировать, где каждый
          кадр — это вдохновение для нового проекта. Я верю, что жизнь — это не
          только код, но и возможность находить красоту в повседневных вещах,
          будь то завораживающий закат или уютное кафе на углу.
        </p>
        <p>
          Моя работа отличается вниманием к деталям и стремлением к
          совершенству. Я всегда ищу вдохновение и готова к новым вызовам. Если
          у вас есть интересная идея или проект, который вы хотите обсудить,
          давайте поговорим! Я открыта к сотрудничеству и всегда готова создать
          что-то удивительное.
        </p>
      </div>
    </section>
  );
};

export default About;
